asciidoc/listings/vol2-clause-appendix-a-mdpws-dev-27-renew.xml

<?xml version="1.0" encoding="UTF-8"?>
<s12:Envelope
        xmlns:s12="http://www.w3.org/2003/05/soap-envelope"
        xmlns:wsa="http://www.w3.org/2005/08/addressing"
        xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing">
    <s12:Header>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2004/08/eventing/Renew</wsa:Action>
        <wsa:MessageID><!-- ... --></wsa:MessageID>
        <wsa:To><!-- ... --></wsa:To>
    </s12:Header>
    <s12:Body>
        <wse:Renew>
            <wse:Expires><!-- ... --></wse:Expires>
        </wse:Renew>
    </s12:Body>
</s12:Envelope>
