asciidoc/listings/vol2-clause-appendix-a-mdpws-dev-32-example-05.xml

<?xml version="1.0" encoding="UTF-8"?>
<s12:Envelope
		xmlns:s12="http://www.w3.org/2003/05/soap-envelope"
		xmlns:wsa="http://www.w3.org/2005/08/addressing"
		xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing"
>
	<s12:Header>
		<wsa:Action>http://schemas.xmlsoap.org/ws/2004/08/eventing/SubscriptionEnd</wsa:Action>
		<wsa:MessageID>urn:uuid:5f089db4-ecdc-4e1d-879d-de59d53e709b</wsa:MessageID>
	</s12:Header>
	<s12:Body>
		<wse:SubscriptionEnd>
			<wse:SubscriptionManager>
				<wsa:Address>https://127.0.0.1:6464/d431eed8-1e29-41df-a99a-7f1a47638a95/SubscriptionManager</wsa:Address>
			</wse:SubscriptionManager>
			<wse:Status>http://schemas.xmlsoap.org/ws/2004/08/eventing/SourceCancelling</wse:Status>
			<wse:Reason xml:lang="en-US">Historic data delivery has finished.</wse:Reason>
		</wse:SubscriptionEnd>
	</s12:Body>
</s12:Envelope>
