wsf_c/savanc/src/subs_mgrs/registry/test/ab/renew.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wse:Identifier xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing">urn:uuid:B146139C9D740661737177170386667-1202880726</wse:Identifier><wsa:To>http://localhost:8281/services/SampleEventSource</wsa:To><wsa:Action>http://schemas.xmlsoap.org/ws/2004/08/eventing/Renew</wsa:Action><wsa:MessageID>urn:uuid:a5783504-0947-1de1-2553-0012f0b857ac</wsa:MessageID></soapenv:Header><soapenv:Body><wse:Renew xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing"><wse:Expires>2009-04-26T21:07:00.000-08:00</wse:Expires></wse:Renew></soapenv:Body></soapenv:Envelope>
