pegasus/test/wetest/wsman/Subscribe/InvalidMessageID_Subscription02.xml

<?xml version="1.0"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing">
    <s:Header>
        <wsa:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/eventing/Subscribe</wsa:Action>
        <wsa:To s:mustUnderstand="true">http://localhost:5988/wsman</wsa:To>
        <wsman:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_Indication</wsman:ResourceURI>
        <wsa:MessageID s:mustUnderstand="true"></wsa:MessageID>
        <wsa:ReplyTo>
            <wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
        </wsa:ReplyTo>
        <wsman:SelectorSet>
            <wsman:Selector Name="__cimnamespace">test/testprovider</wsman:Selector>
        </wsman:SelectorSet>
    </s:Header>
    <s:Body>
        <wse:Subscribe>
            <wse:Delivery Mode="http://schemas.xmlsoap.org/ws/2004/08/eventing/DeliveryModes/Push">
                <wse:NotifyTo>
                    <wsa:Address>http://localhost:80/eventsink</wsa:Address>
                </wse:NotifyTo>
            </wse:Delivery>
            <wse:Expires>PT30.000000S</wse:Expires>
            <wsman:Filter Dialect="http://schemas.dmtf.org/wbem/wsman/1/WQL">SELECT * FROM IndicationStressTestClass</wsman:Filter>                                                                                                                                     </wse:Subscribe>

    </s:Body>

</s:Envelope>

