asciidoc/listings/vol2-clause-appendix-a-mdpws-dev-27-subscribe.xml

<?xml version="1.0" encoding="UTF-8"?>
<s12:Envelope
        xmlns:s12="http://www.w3.org/2003/05/soap-envelope"
        xmlns:wsa="http://www.w3.org/2005/08/addressing"
        xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing">
    <s12:Header>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2004/08/eventing/Subscribe</wsa:Action>
        <wsa:MessageID><!-- ... --></wsa:MessageID>
    </s12:Header>
    <s12:Body>
        <wse:Subscribe>
            <wse:EndTo>
                <wsa:Address><!-- ... --></wsa:Address>
            </wse:EndTo>
            <wse:Delivery Mode="http://schemas.xmlsoap.org/ws/2004/08/eventing/DeliveryModes/Push">
                <wse:NotifyTo>
                    <wsa:Address><!-- ... --></wsa:Address>
                </wse:NotifyTo>
            </wse:Delivery>
            <wse:Expires><!-- ... --></wse:Expires>
            <wse:Filter Dialect="..."><!-- ... --></wse:Filter>
        </wse:Subscribe>
    </s12:Body>
</s12:Envelope>
